## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.tftest-mjw-mtasts.azurerm_storage_blob.mta-sts must be replaced
-/+ resource "azurerm_storage_blob" "mta-sts" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://stmwtftestmtasts.blob.core.windows.net/$web/.well-known/mta-sts.txt" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = ".well-known/mta-sts.txt"
      ~ source_content         = <<-EOT # forces replacement
            version: STSv1
            mode: testing
            mx: tftest-mjw.mail.protection.outlook.com
          - max_age: 86400
          + max_age: 86401
        EOT
      ~ url                    = "https://stmwtftestmtasts.blob.core.windows.net/$web/.well-known/mta-sts.txt" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.tftest2-mjw-mtasts.azurerm_storage_account.mta-sts will be updated in-place
  ~ resource "azurerm_storage_account" "mta-sts" {
        id                                 = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/RG-WhiteFam-UKS/providers/Microsoft.Storage/storageAccounts/stmwtftest2mtasts"
        name                               = "stmwtftest2mtasts"
        tags                               = {
            "managed" = "as-code"
            "source"  = "terraform"
        }
        # (97 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = (sensitive value)
            # (3 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>